{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 768,
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "CASH_RECEIVED",
    "1": "COMMAND_GST",
    "2": "COMMAND_REMIND",
    "3": "EXPENSE_LOG",
    "4": "GENERAL",
    "5": "PAYMENT_TAG",
    "6": "QUERY_CUSTOMER",
    "7": "QUERY_EXPENSE",
    "8": "QUERY_PROFIT",
    "9": "QUERY_SUMMARY",
    "10": "UDHARI_CREATE",
    "11": "UDHARI_SETTLE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "CASH_RECEIVED": 0,
    "COMMAND_GST": 1,
    "COMMAND_REMIND": 2,
    "EXPENSE_LOG": 3,
    "GENERAL": 4,
    "PAYMENT_TAG": 5,
    "QUERY_CUSTOMER": 6,
    "QUERY_EXPENSE": 7,
    "QUERY_PROFIT": 8,
    "QUERY_SUMMARY": 9,
    "UDHARI_CREATE": 10,
    "UDHARI_SETTLE": 11
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 250000
}
